 #+title: Signal Processing for Pixelated LarTPC
#+EXPORT_FILE_NAME: index.html
#+setupfile: docs/setup-rto.org

* Introduction

This package provides a framework for training deep learning models to perform signal processing for LArTPCs with pixel-based anodes (DUNE ND).

The currently implemented model is a Graph Attention Neural Network (GAT).

* Install

~NNPixSi~ installs in the "usual Python way".  Use of ~pip~ and a Python
virtual environment is recommended.

#+begin_example
python3 -m venv venv
source venv/bin/activiate
git clone https://github.com/rennney/NNPixSi.git
cd NNPixSi
pip install -e .
#+end_example

* Usage

The ~nnpixsi~ command line user interface provides online help:

#+begin_src shell :exports both :results output code :wrap example
nnpixsi
#+end_src

#+RESULTS:
#+begin_example
Usage: nnpixsi [OPTIONS] COMMAND [ARGS]...

  NNPixSi command line interface

Options:
  -s, --store PATH     File for primary data storage (input/output)
  -o, --outstore PATH  File for output (primary only input)
  --help               Show this message and exit.

Commands:
  eval         Evaluate Model
  train        Train Model
#+end_example

